[36;1mOperations to perform:[0m
[1m  Apply all migrations: [0madmin, auth, contenttypes, dead_south, sessions
[36;1mRunning migrations:[0m
  No migrations to apply.
[{"model": "dead_south.article", "pk": "https://www.southernliving.com/culture/celebrities/andrew-zimmern-aldi-partnership-food-waste-tips", "fields": {"source_text": ["Andrew Zimmern knows food. And while he could talk to you 'til the cows come home about epicurean delights, today he wants to shift our attention to food waste. A dire issue, Zimmern recently partnered with grocery store chain Aldi to raise awareness about the problem and share some of his top tips for reducing food waste. Below, he revealed his top tips with us — and we think they're all game-changers worth following. Join us?", "1. Buy a smaller fridge (or reduce the capacity of the one you have by removing a shelf or drawer).", "Yes, we're looking at you, double-doored, Sally. \"[People should] make their fridge smaller and shop twice a week and the first one makes the second one a necessity. The American refrigerators are so big they're built on American convenience culture. They want us to shop once a week and then when 'mealus interruptus' happens, and it happens to everyone, we wind up throwing out food on Sunday that we bought the Monday beforehand,\" said Zimmern. \"Meal planning is really important, but even more important is to shrink your fridge. I bought a small European refrigerator, and it was the best thing I ever did,\" he continued, adding that if you have a big American fridge simply remove a drawer and take out a shelf for two weeks and see how it goes. ", "2. Put a notepad and a pen on the counter next to the garbage can and write down all food that you put in the trash.", "\"Even if it's that bag that holds the bunches of grapes and there's a cup of loosies at the bottom and they're just bruised and rotted, write that down. At the end of the two weeks, you'll see the patterns,\" said Zimmern. \"I have a friend that wastes a lot of food, and fascinatingly I got him to write everything down. There was one item that every night was on his list, and it just said, 'half a salad bowl.' I asked him about it and was like, 'what do you mean like your own bowl of salad?' He was like, 'you know there's five people in our family, we like a big salad every night, we have this big salad bowl. We cut all this lettuce, tomato, cucumber, and carrots, and then we throw it in there, and we dress it with oil and vinegar and lemon juice, everyone's favorite dressing, a little bit of salt, herbs, and mustard and made this great vinaigrette. We only eat half of it, and then it's wilted by the time we clear the table, and we throw it away,'\" Zimmern recounted. \"I said 'don't throw it away, put it in a bag or a container, and the next morning instead of having pancakes one or two people can have a healthy blended salad as all or part of their breakfast. You won't throw it away and save a meal or two every day depending on the size.'\" Little changes can go a long way, y'all.", "Chronic fruit-tosser? Put old fruit in your freezer before it becomes unusable and repurpose it. \"Before it gets bruised and rotten, and you throw it away, do what we do for bananas with banana bread, throw it in the freezer. Then roast it, turn it into sauces, purée it, turn it into freezer jams, but if you don't write it down you won't know what your trends are,\" shared Zimmern.", "3. Stop stocking up on excessive amounts of pantry ingredients.", "Really. Just hear him out. \"People wind up buying so many things they don't need or are only going to need once, and then they forget to use it up. A great example is someone will decide that they want to make some wonderful Thai dish, and they'll buy some sweet Thai sticky rice, and they soak it overnight, and they steam it for a couple of hours, and it's wonderful and then that rice just sits on the shelf for two years,\" commented Zimmern. \"Then they go into it again and, you know, there's little bugs or something crawled in there, or it drops and spills or someone says, 'oh it's been there for two years, let's get rid of it.' I encourage people, buy less. When I buy a five-pound bag of Thai sticky rice, do I eat it every night? No, but I make a concerted effort every week to cook a dish and use the Tai sticky rice in it. That's good menu planning,\" he said, noting that we should all observe the FIFO principle, — or \"first-in, first out\"— making sure that we use up items that we opened or bought first before moving on to another item (say, that half-opened jar of medium salsa should be used up before you open up a jar of spicy salsa). ", "We're certainly looking forward to incorporating these tips into our daily routines. And making some banana bread, of course."], "output_text": [" Energy efficiency class is a lot like the Energy Star system in that the better you do in class, the more inefficient and wasteful you need to be in order to reach \"Super Ugly Expensive\" class.", " Buying food you intend to prepare and cook at home should not preclude the possibility of spontaneous outings with friends, social events that require an okay to pack food, and all the other things you enjoy during the doldrums that come from being confined to a cubicle and want to make up for at the end of the work week. Also, keep it real – which means getting the full experience you are looking for, including the social bits!", " I threw out both an almost full box of frozen, fresh fruit-berries and a half-eaten bag of celery. After a few weeks of this, I am reduced to the point where I have to trawl the shelves to find food scraps.", " Keep track of exactly what you eat to see where your food dollars are going. Once you have those data points, you'll know what you want to spend more money on during trips to the farmer's market and what you should avoid buying altogether or steer clear of wasting.", " The hunt for morel mushrooms like those pictured above may seem frustrating at times, but consider yourself a lucky few if you're able to look for them in the first place. Photo by Erin McCarthy.", " It's fine to have a collection of baking supplies for working on a recipe, but don't keep buying new ingredients until you know if your recipe will turn out.", " He’s being eco-friendly and helping you to spend less money by avoiding waste and pre-packaged, store-bought instant meals!", " Here's a quick recap of key tips and tricks you should consider adding to your diet, via Mental Floss:"], "title": "Andrew Zimmern on Food Waste Tips "}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/culture/history-of-lowes-north-carolina-origns", "fields": {"source_text": ["The next time you're walking through the aisles of your local Lowe's, picking up paint rollers, picture hanging kits, and refills for your hot glue gun, be aware that you're walking through history. The home improvement giant started right here in the South over 100 years ago.", "The Lowe's story began in North Carolina when Wilkes County farmer L.S. Lowe decided to start his own store, opening Lowe's North Wilkesboro Hardware in 1921. The little shop downtown on C Street sold hardware and building materials alongside sewing notions, dry goods, horse tack, snuff produce and groceries, Our State notes. Lowe was content selling his bric-a-brac to the local community, passing the family business to his daughter, Ruth, and his son, Jim Lowe, in 1940. While Jim Lowe and Ruth's husband Carl Buchan, were off serving in WWII, Ruth and her mother, Floy Elizabeth Lowe, kept the lights on at the store.", "Buchan \"was given an honorable discharge after suffering a foot injury in 1943,\" according to Our State. Back at home, he needed a job and Lowe, still in the Army, made him an offer, do an inventory of everything in the store and, if he paid Lowe \"the equivalent amount in cash, the two would be 50-50 partners.\" Per Our State, \"the inventory amounted to about $12,500\". Buchan bought in to the business and soon things really took off.", "According to the Lowe's history on the company's website, Buchan realized that when the war was over, soldiers would be returning home, starting families, and needing houses. Anticipating the impending building boom, Buchan decided that the store should focus solely on home improvement products—anything a person might need to build, repair, or gussy up a house. The idea was a hit and, come 1949, they opened a second Lowe's in Sparta, N.C.", "Buchan was a business visionary and soon took over the whole family business. It may have made for some awkward Lowe family suppers, but Buchan kept the store name and set about growing the business. Jim Lowe had his own vision, including starting the Lowes Foods supermarket chain. Soon Lowe's, the home improvement store, had over 300 employees and a bustling trade selling supplies to pros as well as DIYers.", "Come October 1961, Lowe's was a publicly-traded company on the brink of serving one million customers a year—a milestone they hit in 1964. Fast forward to 1982 and Lowe's had its first billion-dollar sales year. Lowe's opened its first stores in Canada in December 2007 and started selling building supplies in Mexico in February 2010.", "WATCH: The Home Remodeling Projects That Will Earn You the Most Cash Back", "The Lowe's story is truly inspirational for any small-town store owner dreaming of becoming one of the big guys."], "output_text": [" Read the whole thing.", " Solving racism at Lowe's involves having a white guy who serves as mayor of an historic black town quietly (and accidentally) endure some racism in 1940-1988 and then quietly put up with the lack of a response when he told his \"humorous tale\" to a journalist in 1989.", " Buchan bought a half share of the store with a $2,000 loan and has always been running Lowe & Eagle ever since (messing around with pencils on the job). Eventually he opened next door, Pro Framer and then next to that, Framer's Paradise. Buchan also started what became Center Point Printing, helping make Archer, who he met while stationed in France during WWII, \"the world's leading paper and envelope manufacturer", " The man who gave us the store where we buy our house accessories despised the institute that educates so many of the people who give us other house accessories. An opposing team wins again.", " Jim Lowe became a badass store manager for Tandy leather store that was renamed \"Lowe's.\" At 77, he opened an hardware superstore and grew it to be one of the leading home improvement chains. He was a business visionary, but also always took great care of employees. Even during the Great Depression, he scraped together half the money to put his employees through night school when he closed the store two nights a week. And Lowe", " Craftsmen realized, \"We can sell this shit to dopes. For profit.\"", " Your blood pressure rises, focus narrows like a laser, and self-doubt disappears. Also, your brain is literally rewiring itself to handle the most stressful command it has ever received. “It is in this state of extreme activation of the amygdala, the part of your brain that is most wired for the fight-or-flight stress response, that your best and most powerful ideas tend to surface and come into consciousness,”", " 5 things you should now about @LowesCarHIre, the Biggest Little Store in the Valley #SBAHigh50 pic.twitter.com/koMymDKq3f — Chiltern Railways (@ChilternRail) September 30, 2016"], "title": "Lowe's 100 Year Old Origin Story"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/culture/kevin-costner-son-joe-costner-field-of-dreams-game-catch", "fields": {"source_text": ["Fans of baseball, Kevin Costner, and the 1989 film Field of Dreams, hit a triple when Major League Baseball held its long-anticipated Field of Dreams game. Inspired by the movie (which in turn an adaptation of W.P. Kinsella's novel Shoeless Joe) a temporary stadium was built near the site where the film was shot, the players dressed in retro uniforms, emerging from the corn fields to play a game to remember.", "While fans were gathered in Dyersville, Iowa, to see the nostalgia-fueled face-off between the Chicago White Sox and New York Yankees, one of the match's highlights had nothing to do with professional sports, but a game of catch between father and son. During the game, Kevin Costner, who played Iowa farmer Ray Kinsella, who built a baseball field in his cornfield, threw the ball around with his real-life son, Joe Costner. It made the trip down memory lane even more special for the star.", "\"Last week the @mlb gave me a chance to \"have a catch\" with my son at the Field of Dreams,\" Costner wrote in a caption to his Instagram post. \"Joe was just a baby when we made Field of Dreams—a movie ultimately about the relationship between a father and son. It felt completely full circle to share this incredible experience with him.\" ", "Fans of the film are about to get more to love. A miniseries adaption of the classic baseball movie is being made by NBC's streaming service Peacock, according to The Hollywood Reporter. No surprise that Hollywood wants in on the fun—the Field of Dreams game was the most-watched regular-season game since 1998.", "WATCH: Alabama Grandpa Moves the Masses with Bucket of Old Baseballs", "If you create it, NBC, we will watch it."], "output_text": [" If this is a dream, don't wake me up or you'll break the circle of magic. If this is not a dream, don't wake me up or you'll break the circle of magic.", " Your browser does not support iframes.", " The Field of Dreams in Iowa as you know it is the real deal. Beware the regrets of passing it by for the opportunity to talk to Bulls players.", " There may not be any Kevin Costner, but it'll still feature beloved actors such as Ray Liotta, James Earl Jones, and Amy Madigan reprising their roles from the hit movie.  No word on whether or not they'll do the iconic catch phrases such as, \"Dad?...Dad?!\" but we're holding out hope.", " It was totally his week. ABB just released their “where the hell were you on October 19th?” clothing line. There’s always fuckboy talk with ugliness. Finally, Dworkin reviews My Gentle Harrassment. Abe Lincoln Reads Stuff. And Sweet Chin Music is our #FunAssGaySummerPic that 100% predates Philly’s. Enjoy a Summer That Lasts…Until He", " Mary Kills People is now streaming on SlingTV. And, in about four years, it’ll be on NBC."], "title": "Kevin Costner Plays Catch on Real Life Field of Dreams"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/culture/lucille-ball-siriusxm-podcast", "fields": {"source_text": ["During the sixties, while Lucille Ball was busy with her hit sitcom, \"The Lucy Show,\" she also produced a daily radio program called \"Let's Talk to Lucy.\" The program's tapes, which haven't been heard for decades, are now widely available via a SiriusXM channel and a new podcast.", "According to SiriusXM, \"In between starring in four television series and more than 70 films, Lucy would jump from set to set—tape recorder in hand—to talk about all aspects of life with some of the biggest names in Hollywood history.\" The stars Ball chatted with were also her friends. There are 240 episodes in all, and in them Ball talks to stars of stage and screen including Carol Burnett, Frank Sinatra, Dean Martin, Mary Tyler Moore, Bing Crosby, Bob Hope, and Barbra Streisand.", "The radio show tapes, which have been living in the Ball family archives for decades, are now being repurposed as a podcast. Episodes have already begun to air on SiriusXM's pop-up channel, Channel 104, and they will soon be available to stream on other platforms, including Pandora, Stitcher, and the Sirius XM app.  ", "Lucie Arnaz, Lucille Ball and Desi Arnaz's daughter, said in a press release, \"Although I have been caretaking these ancient tapes for over 30 years, I had never really listened to them all and had no idea how many remarkable people Mom had talked to on these radio shows. It's a treasure trove of personal information from some of the greatest talents of American entertainment and my family and I can't wait to share them with the rest of the planet.\"", "In addition to the archival interviews, the podcast will also feature new programming that invites stars of today, including Ron Howard, Tiffany Haddish, Debra Messing, and Amy Poehler, to talk about Ball and her legacy.", "You can tune in and find more information about the podcast at siriusxm.com.", "What's your go-to podcast for daily listening? Have you heard any of the \"Let's Talk to Lucy\" programs?"], "output_text": [" I'll explain how to get the podcasts a bit later, and hear Lucille Ball, Desi Arnaz, Vivian Vance, and William Frawley share stories and memories of the legendary I Love Lucy show. Desi Loves Lucy: Having recorded almost all of the episodes in the years before they became celebrities, the five of them also have tips for young aspiring actors!", " click this link and visit treasure trove.", " this podcast is a great way to get caught up on the major events of the 90s if you weren't alive then and want to skip the sketchy things your mom shows you on BuzzFeed videos. [ 13 th Inning ]", " Long dead celebrities said a lot of weird shit. Now Lucie Arnaz is selling it.", " Everything but the alien degus.", " NPR's Serial is now hosted and produced by The Marshall Project and is officially titled Criminal. It still has all of the same folks, but now gets host production from some of the same folks behind acclaimed public radio programs like This American Life. (Alex)", " Lucy is a podcaster interested in location-independent lifestyle topics and curating those into high-quality episodes. I’ve had a great time chatting with her and highly recommend it!"], "title": "Lucille Ball Has a New Podcast on SiriusXM Featuring Interviews with Frank Sinatra, Carol Burnett, and Mary Tyler Moore "}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/culture/music/otis-redding-80th-birthday", "fields": {"source_text": ["Soul singer Otis Redding was still ascending to super stardom when the blues-rock band Rising Sons got the nod to open for him at a West Hollywood club in the spring of 1966. Taj Mahal, not yet the acclaimed bluesman that he would become, was lead vocalist for the short-lived group. ", "In an interview nearly 45 years later, Mahal remembered the buzz-generating performance at the Whisky a Go Go club well. Not so much his band's, but Redding's. He'd never witnessed anything like that four-night stand.", "The raw emotion. The frenzied pace. The utter soulfulness of it all.", "\"This cat just had the rafters falling down,\" Mahal told music journalist Harvey Kubernik in a 2010 article in the record collector magazine Goldmine. ", "Redding \"wasn't trying to articulate like anybody else,\" Mahal said. \"He was himself.\"", "That Redding stayed true to himself – and true to his Georgia roots – has been long celebrated in the city where he grew up.", "Located 80 miles south of Atlanta, Macon bills itself as \"The Song and the Soul of the South.\" Though it's been 54 years since Redding's death in a plane crash at the tragically young age of 26, his music is still frequently heard on the jukeboxes in the city's bars and restaurants. For local bands, his songs –\"(Sittin' on) The Dock of the Bay,\" \"Respect,\" \"Hard to Handle\" and many others – are always in their back pockets.", "\"If you really want to get the crowd going, you play Otis. That's what you're going to do in Macon, and everybody is going to know the words and sing it with you. No doubt,\" said local singer Kim Meeks, who performs at various venues around the city. ", "Redding's name is often the first recited in a litany of musicians who were either born in, lived in, or recorded in the city. Those include \"Little Richard\" Penniman, James Brown, Lena Horne, the Allman Brothers Band, the Marshall Tucker Band, two members of R.E.M., and Jason Aldean.", "That Redding's name rises to the top, \"that's saying something,\" said Ron White, who grew up in Macon and now fronts a band, Blue Mischief, that picks up gigs around Atlanta. \"Otis Redding's legacy is something that will always be remembered there.\"", "And elsewhere. In 1989, Redding was inducted into the Rock and Roll Hall of Fame. Four decades after his death, Rolling Stone magazine readers ranked him the all-time best rhythm and blues/soul singer.", "Redding will be the center of attention once again during a virtual tribute marking what would have been his 80th birthday. It starts September 9 and continues through that weekend. More information will be available at otisreddingfoundation.org.", "It's the latest in a string of local remembrances and honors that have come over the decades: Two bridges are named for him, one in Macon, where he spent the first part of his life in a segregated housing project, and one on the outskirts of the city in Jones County, where he bought a sprawling ranch to live with his wife and children. A life-size statue was erected on the banks of the Ocmulgee River. Commemorations have marked his passing and milestone birthdays.", "The Otis Redding Foundation, run by his family, operates a mini-museum dedicated to Redding on Cotton Avenue in what was once Macon's Black business district. It draws roughly 5,000 visitors annually. Several weeks ago, actor, director, and screenwriter Tyler Perry stopped in to pay his respects.", " \"We appreciate when artists or musicians who are in town come to the museum,\" said Redding's daughter, Karla Redding-Andrews. \"It's small, but it tells a great story.\" ", "Redding began developing his talent in his youth by singing in the church. He went on to enter teen talent competitions at the African-American owned Douglass Theatre, winning 15 times, said Redding-Andrews. \"He was politely asked not to enter again,\" she said.", "He got a big break when he recorded a song he had written, \"These Arms of Mine,\" using leftover studio time meant for another musician. ", "\"He was always great, but he got even greater as the years went on,\" said Alan Walden, whose late brother, Phil, became Redding's manager in 1959. Walden said he later shared those duties with his brother.", "With his success, Redding could have left the area, which wasn't known for its progressive attitude toward Black people and civil rights. But he chose to stay. The Waldens grew up in Macon and were based there too. Two years after Redding's death, Phil Walden and Frank Fenter would establish Capricorn Records, a label that became synonymous with Southern Rock. ", "\"He loved Georgia,\" said Redding-Andrews, referring to her father. \"He knew he had to work outside of Georgia some, but knew he always needed a connection to come back home.\"", "Performing on the road, Redding often allowed people from his hometown to come backstage for a quick hello, Alan Walden recalled.", "But it's not only memories that are keeping Redding's presence felt in Macon. His family, through the foundation, is continuing the investment in young talent that Redding started in 1967 with a music camp for 300 children. Since 2008, for two weeks each summer, the Otis Music Camp has brought together 50 to 75 youths, ages 12 to 18, to hone their skills at singing, songwriting and playing instruments and to learn other aspects of the music industry, from producing and audio engineering to how to legally protect what they create.", "There's the separate, four-day Camp Dream for \"the littles,\" ages 5 to 11. ", "\"That's how Otis Redding still makes an impact,\" said his grandson, Justin Andrews, whose mother, Redding-Andrews, was just 5 years old when her father died.", "It's a family affair, involving Andrews, who serves as administrator of the Otis Music Camp and Camp Dream, his mother and the music legend's wife Zelma, and his sons Dexter and Otis Redding III, who had some success with their own band, The Reddings.", "The foundation enlists the help of two dozen coaches from Georgia and around the country. Some industry heavy hitters also have given their time, including Eric Burton, a member of the Grammy-nominated Black Pumas, a psychedelic soul band based in Austin, Texas. Last year, after leading a virtual session during the pandemic, he teamed up with Fender to donate acoustic guitars to all of the campers.", "In addition, the foundation offers private music lessons, with director Kimberly Kelsey Epps recruiting instructors from Mercer University, Middle Georgia State University, and Kennesaw State University and other outlets.", "Right now, the lessons and the camps take place at different locations. But, long term, the foundation hopes to house all of its programs at a facility in downtown Macon. ", "One day, another building in the heart of the city also might bear his name. Talk of adding it to the Macon City Auditorium has bandied about for years.", " \"If it happens, it happens. If it doesn't, we're still great supporters of this community and always will be,\" said Redding-Andrews. \"The whole community has been so welcoming and so open armed to Otis Redding.\" "], "output_text": [" When a London pub landlord refused U.S. sailors entry, they responded by battering him to death with hurling benches.", " they made everyone listen.", " Dig this study in contrasts, by a band whose star is only just beginning to shine.", " Buses, birds and bisexual Berlin drag queen rappers.", " Redd knew hip-hop, across its varied spectrum, not only in terms of its words, but also its sounds. He embraced the intricacies of styles and swayed against the expected and the mild.", " He was predicted to go to the Superbowl every year from 2017 to the End of Time, but only went to one or two more actually and made sure the team/owners/everyone else was more successful than he was so they could move on without him.", " Southern soul is alive and well in Macon, serving up cracklin-fried chicken to that's-what-I-said folks and swampy, scratchy, finger-lickin' soul to all listeners.", " Otis Redding was an OG from Macon who had a song with the word \"sock\" repeated in it at the drop of a dime; this makes Macon worth it as evidenced by merely a sketchy outline of the picture I've attempted to paint here. GO TO MACON ASAP.", " I frequently find myself near the Bridge to Nowhere, an actual part of Redding. The name comes from folks who cross the Sacramento river into the city and ask, “Where the hell am I?” if they don't have a destination in mind.", " Macon girl just wants a day named after my daddy.....There are folks who can remember the day they heard the biggest, best, most famous soul singer in the known universe — locally grown, for sure — had died in a plane crash trying to bring that Southern soul to Detroit. But, that was in December 1967. It's been a long time, and often left unspoken, though touched on over the years, that the nearest city for", " In a one-line summary, Otis Redding is typical of my book heroes: he’s a rebel.", " If you hated school, you'll probably want to skip the museum. If you didn't, you might enjoy spending a couple of hours.", " the Andrew Lewis Foundation was started by Andrew Lewis (CFRG CPO®, USM2) to give Strummers in West Africa the chance to become professional musicians. The foundation provides individual backing for musicians, studios and production to record their music. It helps their music reach a larger market and may change their lives as a very stable and reliable source of income for years to come. Send goodwill and support Andrew on  www.crowdf", " Aretha Franklin Has Died", " Otis Redding's career exploded after playing a gig at a bar in Macon.", " man takes 10 years to get degree; alters perspective on mortality", " Are you, our readers, from SC, Texas or Oakland? Are you a James Brown fan? Does this story of Aretha Franklin and James Brown catch your eye? Does it steady your nerves?", " Otis Redding started a music camp in Macon over 40 years ago... and it's still alive and kicking strong. I'd love to see Tennille Bishop, Otis' wife, leading those music campers in song", " It's expensive, weird, and potentially awesome.", " Even though Redding is dead, his name was frequently invoked by Walker, as an exemplar of the kind of power a union can exert, and the problem that power allegedly presents to rational policy-making.", " AltDaily Kickoff Party, Fancy Nancy's, 8 p.m., $10. (If you're asking what in the blue blazes an \"Altdaily\" is, VICE magazine did write-up on it.)", " Learn how to FMOD from the person who rewrote the documentation for MuseScore!", " the foundation provides live music, a library of historic music, education, and help for musicians in need.", " If your through-the-roof anti-flag, anti-USA cowboy-rebellion fantasy involves twirling a lasso and throwing explosive arrows, then a camp in lower Alabama or Georgia is probably going to be the next place you'll go.", " It might become the Jack Plunkett Center for Music and Performing Arts. Complicated? No. Creative? Yes.", " We're not allowed to name the person or persons who donated their full, (some) bone marrow to our overall cause. They – along with majorfag, Shadoow, Sheef, and a woman's name Tiggith the Troubador, are owed nothing but our deepest gratitude. As I told them, I'm not playing fucking asshole any more, we need all the help we can get and if they want to remain anonymous"], "title": "Remembering Otis Redding: How His Family Keeps His Legacy Alive In Georgia and Beyond"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/fashion-beauty/southern-fashion/plaid-dresses-for-fall", "fields": {"source_text": ["As the unofficial pattern of fall, once you start seeing plaid fill the racks and shelves of stores, you know the season of pumpkin spice and falling leaves is near. These plaid and flannel-inspired dresses will help you welcome the new season in style. The best part about plaid dresses is that they're great for wearing at the beginning of fall when temperatures may still be a little warm and they can also be layered later into the year as temperatures drop. Whether alone or paired with a denim jacket or cardigan, plaid dresses can be dressed up or down for any occasion based on the shoes and accessories they're paired with. From game day to Sunday school to dinner with friends, these plaid dresses will be the perfect ensemble for any event you'll be attending this fall. "], "output_text": [" Plaid parties."], "title": "Pretty Plaid Dresses To Wear All Fall Long | Southern Living"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/garden/fall/fall-aster-flower", "fields": {"source_text": ["Tired of repurchasing pots of mums year after year? Even if you treat them as perennials and plant them in your garden, mums can feel quite samey come fall. There's a reason every garden store has piles of mums for purchase during the autumn months, and it's because everyone and their sister buys pots of the yellow, orange, and red blooms for their porches and entryways. If you'd like to try something new and branch out into the broader world of fall flowers, check out fall-blooming asters, a fresh alternative to mums.", "There are lots of asters to choose from come late summer and fall, and they also have a wide shade range. According to The New Southern Living Garden Book, \"The flowers come in white or shades of blue, red, pink, lavender, or purple, mostly with yellow centers; they bloom in late summer to early fall.\" When you plant asters, they'll require full sun and regular to moderate water, depending on the climate. While they work in pots, you can easily treat them as perennials, which will allow you to look forward to their blooms year after year.", "One of the last asters to bloom in autumn is aromatic aster (Symphyotrichum oblongifolium, Aster oblongifolius). It's native to the South, particularly in places like Missouri and Kentucky, and grows to 24 inches tall, sending its fragrance out and its purple, blue, or pink blooms up into the air. It's lovely grown in pots but can also be used in beds and edging.", "For planting ideas, turn to The New Southern Living Garden Book, which says, \"Taller asters are invaluable for abundant color in large borders or among shrubs. Large sprays are effective in arrangements. Compact dwarf or cushion types make tidy edgings, mounds of color in rock gardens, good container plants.\" Plant a few pots this season to add a bit of difference in your autumn decor. ", "Learn more about asters at southernliving.com.", "What's your go-to fall flower? Do you buy mums every year, or do you have fall-blooming perennials in your garden?"], "output_text": [" If you're in the market for a fall plant that's easy to grow and easy on the eyes, asters are your go-to plant.", " Grow asters in pots to display in a mixed container like this. Image via Brittle Blue Design.", " Aster aren't your granny's flowers and perhaps shouldn't be compared with the strong-scented Queen Anne's lace, for at their best they almost smell like coffee.They're a must-have for the late-fall-flower lover or anyone who loves flowers so lovely as to almost elicit swoons.", " Buy an aster. It's cheap!", " Berries trump avocados as summer's ultimate food.", " garden tour to Uptown, Banks, OHSU, and more!"], "title": "Asters Are the Fall Flower That Will Replace Your Mum Habit | Southern Living"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/garden/indoors/best-houseplants-for-low-light", "fields": {"source_text": ["If you love plants but live in a space that's lacking in light, don't despair. There are plants that you can grow even in the darkest of corners and dimmest of rooms. From long-loved houseplants like philodendrons and parlor palms to new favorites with beautiful leaves, like calatheas and arrowhead plants, there's a species on this list that's perfect for your window-challenged abode. Once you've chosen a new plant or two, remember that the most important part of tending houseplants is to pay attention. Checking on them regularly and identifying their light and water needs will help you help them. Even the hardiest of houseplants need some time to adapt to new spaces. All of these plants can tolerate low light, though some do grow best in medium indirect light. Do a little research and find the ones that will work for you.", "Syngonium podophyllumArrowhead plants have spade-shaped flowers in a variety of colors, including green, cream, silver, and pink. They tolerate low light and appreciate high humidity.", "Calathea sp.These easy-to-grow plants can thrive in spaces with minimal sunlight. They're prized for their foliage, which has striking colors and patterns. The species Calathea orbifolia has luminous green leaves.", "Aspidistra elatiorThese plants come by their common name honestly. They are very hardy can withstand most all conditions indoors, including low light.", "Dracaena sp.These pretty houseplants have strap-shaped leaves, many of which are striped with shades of green, cream, and grey. They have low light requirements and, in the right environment, can grow to 5-6 feet tall.", "Fittonia albivenisNerve plants can thrive in dim light. They are known for their foliage, which is deep green with red, pink, or white veins.", "Sansevieria trifasciataThese low-maintenance plants tolerate both low light and drought, which makes them popular plants for busy people. Just be sure to check on them every now and then to ensure they're growing well.", "Chlorophytum comosumWhile they grow best in medium levels of indirect light, the hardy spider plant can survive in low-light situations. Plant them in hanging baskets for a stream of lively green-and-white foliage.", "Chamaedorea elegansWith a name that nods to their popularity as houseplants, parlor palms are compact, slow-growing plantings that can thrive in small spaces and dim light. Their calling card is a burst of bushy, deep green foliage.", "Peperomia sp.These ornamental plants are grown indoors for their pretty foliage, which comes in an array of shapes and patterns. Peperomia albovittata has watermelon-patterned leaves that emerge in shady environs.", "Philodendron sp.There are nearly 500 species of philodendrons, some of which are grown as houseplants. They are some of the easiest to grow and have a variety of foliage colors and types. They grow best in dappled light and appreciate some shade.", "Pilea peperomioidesThis plant is also called a coin plant because its bright green foliage is coin-shaped and born lightly on thin stems. It loves the shade and shies away from too much bright light.", "Epipremnum aureumPothos, also known as devil's ivy, is an easy houseplant to grow, not least because it can tolerate dim light and a bit of drought.", "Zamioculcas zamiifoliaThis catchily named plant is a go-to houseplant for hands-off gardeners. It stands up to drought and low light with no trouble.", "What are your favorite houseplants? Do you have sunny windows or are you longing for some light?"], "output_text": [" The plants on this list just want to be looked at.", " They're extremely tolerant of erratic water conditions, new leaves appear on the mother plant in spring, and they're super easy to propagate!", " The exhibition is rare in collecting photographs of places rather than portraits or famous figures. Rock-paper-scissors or paper-rock. It can help you to connect with more people who share the same interests in a much more efficient way. Enchanted Rock Members tj the best time to climb the Enchanted rock (near Bee Cave) is very early in the morning or at sunset. What better way to tell the story of the Aztec than", " The real question here is how can you make sure your air plants live long and prosper in your home.", " Just like your friendships, plants need attention, or they'll have you running for the hills. The infographic below breaks down some of the problems plants can have, their effects on your mental health, and solutions that will have your plant and you back on your feet in no time. Copy and share to remind yourself (and let your friends known) to take better care of your plants!", " Sansevieria favorites include warm, dry, bright spaces with lots of drainage.", " you'd have to be very hopelessly dim or incredibly mean to kill a plant. On the other hand, I once knew a man who was both hopelessly dim and incredibly mean, and he didn't kill any in 10 years.", " Grow one or botany recently popular because of its \"bold\" leaves that varie – fiddle-leaved banana plant.", " Indoor air containing high levels of CO2 can be hazardous to your health. One simple solution or another for home. 19 microfiber on my plants and photo album for my tomato plants a nice flourish to add a little interest as. Mafengwo: Buy & Sell Buy what you need at great prices, find jobs in your area, sell what you have and meet amazing people from.", " How do you grow your philodendron?", " Pilea peperomioidesPlant this plant anywhere it looks good, especially in low light.", " I got sunny windows and added a porch! I am really happy!!"], "title": "13 Great Low-Light Houseplants for Dark Spaces "}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/garden/indoors/calathea-plant-care", "fields": {"source_text": ["We're always on the lookout for pretty houseplants with eye-catching foliage. Some of our favorites are calatheas (pronounced \"cah-lay-thee-ahs\"), also known as prayer plants, which are able to thrive indoors with minimal maintenance. They do best in bright, indirect light, but they can also handle low-light scenarios. We've rounded up a few of our favorites below along with some growing tips, including why you should give calatheas a spay day every once in a while. When talking about calatheas, the first question everyone asks is…", "Calatheas are also called prayer plants because of the movements of their leaves. During the day and night, calathea leaves noticeably lift and dip in a circadian rhythm. During the day, a calathea will have leaves stretching out horizontally from their stems. Check on it at night, and you will likely see the calathea's leaves standing straight up. They like to move! Different varieties have different characteristics, so you should take care when you…", "Finding the best calathea for you comes down to the conditions of your space. Some of the most popular and easy to grow are Calathea ornata, a variety that has glossy, deep green leaves with pink or white pinstripes. It's also called pinstripe plant. Calathea orbifolia has luminous, bright green leaves with lighter green stripes across the surface. Calathea lancifolia is also known as rattlesnake plant because of the striking patterns of its leaves. Each has its own care requirements, so study their needs and decide which varieties might grow well in your home. After you choose the calathea that speaks to you-and is best for your space-there are a few steps to take to…", "Calatheas like medium to bright indirect light, however if all they receive is low light, they can often adapt and tolerate that condition too. They don't need frequent watering. It's recommended to water calatheas every 1-2 weeks at most. It's important to allow the soil to dry out between waterings to keep the plants from becoming waterlogged. They also love humidity, which is why you should…", "Calatheas love humidity, and they're known to thrive in spaces with humid conditions. You can place them in humid areas in your home, or you can give them the occasional spa day. It might sound strange, but its recommended that you bring your calatheas into the bathroom when you shower so that they can soak in an approximation of tropical conditions.", "Do you have any calatheas growing in your home? What's your go-to houseplant for low-light spaces?"], "output_text": [" Approximately 30 seconds", " This is the coolest plant ever.", " Best plants to grow indoors in low light include cactuses and aloe vera. Set up your conditions first learning how to water cactuses or how to care for aloe vera. Water your plants properly so they thrive.", " ventilation can cause a burning or pale appearance, particularly on old leaves. In more extreme cases, your calathea plant will drop it's oldest leaves to cope with heat and/or lack of humidity.", " Calathea are so easy to care for, they're the perfect plant for apartment dwellers. The cheapest ways to care for them: just water them a bunch whenever they feel dry, and you'll get these little air purifiers that will decorate your space.", " What are other fun tips to keeping low-light houseplants near windows alive?"], "title": "Low-Maintenance Calatheas Make the Best Houseplants | Southern Living"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/recipes/chicken-bacon-ranch-casserole", "fields": {"source_text": ["Preheat oven to 375°F. Cook penne according to package directions; drain, reserving 1 cup cooking water. Place pasta in a large bowl, and set aside.\n                    ", "Heat a large skillet over medium. Add bacon, and cook, stirring often, until crisp, about 5 minutes. Using a slotted spoon, transfer bacon to a plate lined with paper towels. Reserve drippings in skillet.\n                    ", "Add garlic to hot drippings in skillet over medium, and cook, stirring constantly, until fragrant, about 1 minute. Whisk in whipping cream and cream cheese; cook, whisking often, until cream cheese is melted and mixture is smooth, about 2 minutes. Remove from heat, and stir in Parmesan, ranch dressing mix, pepper, and reserved 1 cup cooking water. Pour over pasta. Fold in chicken and 1 cup of the mozzarella cheese. Pour mixture into a lightly greased (with cooking spray) 13- x 9-inch baking dish. Top with bacon and remaining 1 cup cheese. \n                    ", "Bake in preheated oven until golden and bubbly, about 20 minutes. Sprinkle with parsley, and serve hot.\n                    "], "output_text": [" Put That Bitch In A Sandwich", " Everybody Likes It But Me", " a huge burst of flavor that hides a lot of protein. ", " Instead of using raw potatoes and tortillas to make wraps, try cucumber."], "title": "Chicken-Bacon Ranch Casserole Recipe"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/syndication/downton-abbey-2-a-new-era-release-date", "fields": {"source_text": ["It's time to stop calling it Downton Abbey 2. ", "Lords and ladies, we have a proper name for the sequel: Downton Abbey: A New Era.", "The announcement was made as a short teaser — that included a hint of a wedding — from the film was shown at CinemaCon in Las Vegas Wednesday night. ", "Carnival Films, the studio behind the next installment, also gave us a new in-theaters-only release date: March 18, 2022. It was originally slated for a holiday/Dec. 22 release.", "Julian Fellowes returned to pen the screenplay for the movie, which brings back the beloved Crawley family and the staff of Downton, including the original principal cast members (i.e. Michelle Dockery, Maggie Smith (who had a tiny moment at the end of Wednesday's CinemaCon tease), and Jim Carter. ", "It was previously announced the franchise is welcoming new talent for the sequel. Hugh Dancy, Laura Haddock, Nathalie Baye, and Dominic West are part of the cast in undisclosed roles. In fact, Violet's (Smith) line in the trailer was to West's unnamed character, with her quipping, \"What a colorful life you lead.\"", "Additional reporting by Lauren Huff.", "Related content:", "Surprise! Downton Abbey movie sequel heading to theaters this ChristmasDownton Abbey star Hugh Bonneville says there's a script for the film's sequelThe stars of Downton Abbey share their favorite Dowager Countess zingers", "This story originally appeared on  ew.com "], "output_text": [" Reithian. LibDem Europhile. We're not Downton Abbey 2. — Ricky Gervais (@rickygervais) September 22, 2015", " The new title, Downton Abbey: A New Era, makes sense. But the characters themselves would probably have described it as \"very poor taste.\"", " There seems to be a wedding guy. He might be defending the groom.", " Tweet your hate at Emily Blunt, who follows her husband around the world pic.twitter.com/KhjIZoAuSy — Ryan Broderick (@broderick) November 8, 2017", " Film looks like it's going to rival the awesomeness and heart of season 3.", " Frank will do pretty much what you expect him to do because that's what Frank does: he's a mobster.", " I got a rape shield law changed so that police would preserve rape kits in the event that the victim reported the crime but the charges did not lead to a conviction.", " Look at the comments on Facebook by male anti-feminists who claim to support men's rights, and look at which feeds they link to, and you will get a sense of what these people are really about.", " SLIGHT SPOILER  in the title somewhere. The rest of you...grab a chaise lounge, order a cocktail or three (or four, c'mon), and enjoy your Sunday.", " Money breeds culture; the more money stars make, the more pop culture content and quality rise too; money also breeds storytelling skill. If celebs are worth their zeros, more audiences will get it and that's better for everyone."], "title": "Downton Abbey 2 gets official title, moves to March 2022 | Southern Living"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/travel/alabama/pants-store", "fields": {"source_text": ["When I first moved to Birmingham, Alabama, from Virginia six years ago, I found myself bewildered by and in awe of three things: white barbecue sauce; the use of \"Roll Tide\" or \"War Eagle\" as a greeting; and the Pants Store, a shop I presumed sold pants and pants alone. A few months into living here, around the same time that I pledged loyalty to mayonnaise-based barbecue sauce and the Crimson Tide, I learned what the locals already knew: the Pants Store does, in fact, sell more than pants.", "But it hasn't always been that way. According to the Pants Store website, founder Taylor Gee got his start selling pants out of the trunk of his Mercury in 1950. From there, people began shopping his Leeds, Alabama, warehouse, which was filled with bins of pants, and dubbed his place \"The Pants Store.\"", "Even as the years passed and the inventory diversified, the name stuck, and the store's presence expanded across the state. Today, there are five Pants Store locations in Alabama (Mountain Brook, Trussville, Leeds, Huntsville, and Tuscaloosa), plus you can shop online at pantsstore.com. But no matter where you're browsing, they've got something for everybody.", "It's a veritable one-stop shop: The Pants Store can dress every member of the family from head to toe (shoes and accessories included, of course); and brands run the gamut, from old favorites like Levi's to more contemporary Southern brands like Fish Hippie and Spanx. They also sell an assortment of other sundries, like stainless steel water bottles and satin pillowcases, and carry an impressive lineup of game-day gear, like branded polo shirts and stadium-approved clear purses.", "In other words, you can find everything you need, everything you want, and then some at the Pants Store—assuming, of course, that you're not a Georgia fan. You won't find Dawg gear here.", "WATCH: Auburn, Alabama, Is Creating a Winning Food Scene–And You Should Visit Now"], "output_text": [" Pants Store has been selling random knick-knacks (buttons, refrigerator magnets, belt buckles, etc.) since the 1970s. Why \"Pants Store\"? because people used to walk into the store and say, \"I need pants.\" causing the store owners to serve a side-business of random memorabilia.", " It all started with a bunch of clothes in a warehouse.", " Pants for everyone.", " The Pants Store is your one-stop shop for, well, pants (and everything else under the sun).", " probably the greatest sporting goods store on Earth.", " Take over the bar at One & Only Ocean Club. Just don't ask any questions."], "title": "Yes, Alabama's Pants Store Sells More than Pants"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/travel/texas/cafe-momentum-chad-houser", "fields": {"source_text": ["Chad Houser says that when he began pitching the idea of a restaurant staffed by former juvenile offenders, he was at times laughed out of the room. \"People said things like, 'Those kids don't want to work; they just want a paycheck.' Or, 'Those kids have never been to a nice restaurant; they can't cook your food.' \" But Houser, a chef who had volunteered in the juvenile department for years, knew that wasn't true. ", "He and a group of those teens began hosting successful pop-up dinners all over Dallas, and 12 months in, Houser sold his partnership in his own restaurant to start work on Café Momentum, a nonprofit eatery and yearlong post-release program for teens who have spent time in the area's juvenile-detention facilities. \"It's one thing to tell those kids you believe in them, and it's something different to prove it,\" says Houser. The restaurant opened in 2015, and beyond just providing job experience, the program also has what Houser calls an \"ecosystem of support.\" At their community center, there's a case management team to assist with financial literacy and parenting classes, a closet stocked with essentials free for the taking, and a school to help students finish their coursework. \"We receive accolades because what we do is working from the standpoint of reducing recidivism and increasing high school graduation,\" says Houser, who is helping launch the program in Pittsburgh and Nashville this year. \"But what I'm most proud of is that the kids get to say, 'I did this. I showed up. I graduated.' Whatever the accomplishment, it's theirs; they get to own it. They deserve that recognition.\""], "output_text": [" Farm-to-table breakfast, lunch, and dinner. Education program for students on positive life skills and gastronomic arts. High school diplomas for students.", " to be happy, do good, make popsicles, and be a hot Kevin Bacon"], "title": "The Inspiring Mission Behind Dallas' Cafe Momentum "}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/travel/virginia/cape-charles-va-beach-town", "fields": {"source_text": ["This friendly town on the Chesapeake Bay feels a bit like Mayberry. Here on the southern end of Virginia's Eastern Shore, kids shuffle down the pier with fishing poles and Cokes, wispy-haired men swap stories outside the hardware store, and the whole place seems to tuck in for the night not long after the sun goes down. But Cape Charles is decidedly more cosmopolitan than Andy Griffith's stomping grounds. Just east of the hardware store is Hotel Cape Charles, a sleek boutique stay that offers complimentary beach cruisers for guests. Across the street is Cape Charles Distillery, where they pour elevated cocktails crafted with locally made spirits.", "Once the economic hub of the Eastern Shore, Cape Charles settled into a sleepier routine with the decline of the railroad industry and the opening of the Chesapeake Bay Bridge-Tunnel. But more than 50 years later, the salty little hamlet has officially made a comeback, holding tight to its small-town character even as it welcomes a new and growing crowd of beach lovers. Now meet the folks who are ushering Cape Charles into its most exciting chapter yet.", "Carol and Beth Ann SaboThe Sabo sisters are not very good at retirement. \"The joke on the Shore is that everybody has two jobs,\" says Beth Ann. \"We already had second jobs (I train dogs, and Carol owns Machipongo Trading Company up the road) when we had careers. Once we retired from our full-time gigs as an equine vet and forensic scientist, we just needed another thing to fill the career space.\" They did that with coffee, bagels, and new and gently used books. In November 2018, they opened Peach Street Books in a light-filled 1930s building that had been a Pure Oil station and then a garage. \"We love the feeling here,\" says Beth Ann of the cottage-meets-contemporary space. \"We knew from the plans what it would look like but not what it would feel like—welcoming and cheery. It has historic angles but is still modern, which is very much like Cape Charles itself.\" For the sisters, the bookstore is a means of connecting with each other, their neighbors, and anyone else who meanders onto this stretch of the Eastern Shore. \"When you go into a town and see that there are other people who love books and reading or writing, it just gives you a good feeling of community,\" says Beth Ann. \"It makes the world seem both smaller and larger at the same time.\"", "Mark and Chris MarshallThe siblings and business partners are near-perfect foils for each other. Mark, the self-proclaimed \"serious brother,\" wears a collared shirt and wiry glasses. He talks about things like the town's old \"cash economy.\" Chris, aka \"fun brother,\" looks more like a surfer than a sales guy and wears a T-shirt he tie-dyed himself. But that's probably why the two work well together—and also why their Cape Charles Brewing Company is enjoying so much success. \"We wanted to create a true destination: a place where you could have a great craft beer, eat good food, and listen to music,\" says Mark. For Chris, the proof that they had done just that was parked right outside—at least before the coronavirus pandemic. He pulled into the brewery parking lot one day to find license plates from all over: Pennsylvania, New Jersey, New York. Now, as people begin to feel safer and more comfortable traveling, the brothers hope to see a full lot again this summer. \"You have this pristine piece of geography here,\" says Mark. \"It's a little slice of paradise that everybody is finding out about and coming down to discover.\"", "Miriam WagnerThe owner of Brown Dog Ice Cream never planned to have a scoop shop. \"My then-husband and I were in Virginia Beach for a wedding,\" she says. \"We had a little bit of time to kill and had never been over the Chesapeake Bay Bridge-Tunnel, so we said, 'What the heck! Let's see what's on the other side.' \" There, they found Cape Charles, a quiet bayside haven. Totally smitten with this place, they closed on a house just 15 days later—something that Miriam says is not altogether unusual for the area. \"That's the story of so many people who live here,\" she says. \"They come, they fall in love with it, and they buy something.\" That was in 2005. Then, seven years later, Miriam found herself with another piece of real estate—a rented retail space on Mason Avenue, the town's main drag—and no idea what to do with it. \"I thought, 'What does a beach town really need?' \" So then she opened Brown Dog Ice Cream, where the tasty flavors are determined by what's in season and what's available just down the road. \"The old adage, 'A rising tide lifts all boats,' is very true here,\" says Miriam. \"To make our coffee ice cream, we source from the local roaster. All the farmers come and bring me the produce that is freshest to use. If I find myself needing more peaches, they will let me go pick them.\" While the menu (which features coffee and doughnuts in addition to its inventive ice creams) changes daily, the welcoming atmosphere at the shop and across Cape Charles in general remains a constant. \"There is a sense of community here, even if you're just visiting this area,\" says Miriam. \"People will come and stay for a week. By the second day, we've talked to them and know who they are. And by the end of the week, they will come in and tell us, 'We're really sorry that it's our last day, but we'll be back next year.' \"", "Don't miss these spots when you visit Cape Charles", "Hotel Cape Charles makes sunny days out on the sand a breeze: Guests can help themselves to complimentary bicycles, beach chairs, and towels. Vrbo and Airbnb also have plenty of good options for visitors who want a little more space.", "Swing by family-owned The Bakery on Mason for warm pastries and picnic-perfect sandwiches. Settle into Ambrogia Caffé & Enoteca for homemade pasta, fresh seafood, and wonderful desserts. Slurp local oysters and catch the sunset from the deck at Shanty restaurant.", "Families will love wide Cape Charles Beach, as the waters of the Chesapeake Bay are calm and shallow at this public stretch of shoreline. SouthEast Expeditions offers stand-up paddleboard and kayak rentals as well as guided excursions. Paddle to a wine tasting on their Chatham Vineyards tour. Shop the length of Mason Avenue for unique souvenirs. Pop into Moonrise Jewelry for fish-leather accessories, or stop by Gull Hummock Gourmet Market to sample local wines and snacks."], "output_text": [" Richmond, Va., hipsters should come together to form a more perfect Union.", " Near Cape Charles, a plan is in place for the area to become the next Cape May.", " Buy books. Read books. Learn to let go of your books once you've read them.", " Enjoy your beer in a church converted into an open-air waterfront brewery.", " Go for: Cape Charles Coffee Bean's \"Roasted in Virginia Beach\" coffees. It only sources beans from local roasters and asks these questions about each: \"Does the bag have a compostable sleeve? Are the beans Shade Grown? Are they grown in the U.S.A., and are they Fair Trade?\"", " Blue Crab Bay Seafood, A Little Slice of Heaven Bakery, Chesco Beach Golf Center, Jolly Roger Mini-Golf, Harry's Dockside Restaurant, and Flagship Cruises.", " Camp in one of Cape Charles’s protected salt marshes.", " Your picture-perfect San Francisco weekend itinerary includes a cozy 21+ hike, salt-rimmed margs, and a picnic in the park.", " charleston weekend getaway port reitz dock walk miles from charleston living fort sumter companies charleston county centers houses courtesy of charleston tourism charleston events restaurants shopping st cruise"], "title": "Cape Charles is the Best Little Beach Town in Virginia"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/weddings/wedding-guest-etiquette-dress-codes", "fields": {"source_text": ["Any well-mannered wedding guest takes special note of the wedding day's dress code and arrives outfitted appropriately — but with your own touch of personal style. The prerequisite to adhering to the dress code? Well, understanding the dress code. From black tie to casual, we're here with an easy-to-follow guide to the top 5 wedding guest dress codes that you'll most commonly see on the lace-adorned invitations. Because there's no time to stress when merriment and a celebration of love is to be had. Here's how to dress confidently for your next wedding. ", "White tie: There aren't many times in life when this dress code will be required of you, unless you're attending a royal wedding, perhaps? White tie attire is the most formal dress code and typically calls for floor-length gowns for the ladies and a black dress coat with tails and matching pants for men, as well as a white bow tie and gloves. White tie attire has been around for a long time, but is pretty uncommon for modern weddings.", "Black tie: This is the most familiar formal dress code. Gents should dress in full tuxedos (possibly substituting a white dinner jacket in the warmer months), and the ladies should wear either elegant floor-length gowns or their most formal cocktail dresses. Since many of us don't have closets full of evening gowns at our disposal, this is the perfect time to consider using Rent the Runway to find hundreds of gowns for rent. Pull out your best jewelry, and don't be afraid to pop a red lip! ", "Black tie optional: This type of wedding is also referred to as simply \"formal.\" As the name suggests, it allows a bit more flexibility than a black tie dress code. Men can wear tuxedos or formal dark suits, and women can wear anything from evening gowns to dressy cocktail attire. Want to straddle the line? Choose a long dress with a bit less structure and more color than a black tie wedding would require. Basically, you can get a little more fun with it. ", "Semi-formal: Also known as \"cocktail,\" this is one of the most popular dress codes, and for good reason. It fits in with almost any wedding venue and is relatively easy for guests to abide by. A semi-formal dress code calls for suits for the men and cocktail dresses for the ladies. Since many women have a favorite go-to cocktail dress — little black dress, anyone? — it's a fabulous idea to wear the same dress for multiple events, paired with completely different accessories. You can also employ sneaky beauty tweaks, such as changing up from hair down to an updo, or a smoky eye to a bright lip color! ", "Casual: Likely the invitation will say, \"dressy casual.\" (Don't get our style editor started on how confusing that term can be for guests.) Going to a beach, farm, or very intimate wedding? There's a good chance the dress code will be casual, but that doesn't mean jeans and tank tops are acceptable — unless otherwise specified, of course. We suggest at least a dress shirt and dress pants or khakis for the gentlemen, and a pretty sundress and wedges or sandals for the ladies.", "Our last handy rules of thumb for all of the above dress codes? First, avoid wearing anything that is more than 50 percent white. Don't want to upstage the bride! Second, keep attire guidelines for ceremonies at houses of worship in mind. Third, some invitations might recommend dressing \"festive\" or (in cases of tropical weddings and the like) \"on theme,\" which might mean to break out the bright colors and bold accessories in addition to adhering to cocktail attire. ", "Finally, when in doubt, always err on the side of overdressed. Who doesn't love an extra fancy night out, anyway? "], "output_text": [" One of the easiest dress codes to understand, but one of the most difficult to execute. If you answered wedding date, place and time to that - think again. This is a tricky dress code.", " Pick the most formal dress code.", " Timeless style that suits any age or body—so rent it if you don't have it! ", " Keep your look classic with a modern twist, and aim to add a couple of playful accessories. Anything goes with a semi-formal look; get creative with your accessories to fit the vibe of your day.", " During the ceremony, think funerals, rom-coms, and ties. After the ceremony, think music festivals, BBQs, and make-out sessions.", " Semi-formal weddings are here to stay, so any descriptors telling guests how to dress should be taken seriously.", " Wear clothes appropriate to where you're going. If you can't wear capris/a tee/or other pieces that go with your true gender, then ask yourself if it's because you should be somewhere else."], "title": "The 5 Most Common Wedding Guest Dress Codes, Explained "}}]