[36;1mOperations to perform:[0m
[1m  Apply all migrations: [0madmin, auth, contenttypes, dead_south, sessions
[36;1mRunning migrations:[0m
  No migrations to apply.
[{"model": "dead_south.article", "pk": "https://www.southernliving.com/culture/celebrities/andrew-zimmern-aldi-partnership-food-waste-tips", "fields": {"source_text": ["Andrew Zimmern knows food. And while he could talk to you 'til the cows come home about epicurean delights, today he wants to shift our attention to food waste. A dire issue, Zimmern recently partnered with grocery store chain Aldi to raise awareness about the problem and share some of his top tips for reducing food waste. Below, he revealed his top tips with us — and we think they're all game-changers worth following. Join us?", "1. Buy a smaller fridge (or reduce the capacity of the one you have by removing a shelf or drawer).", "Yes, we're looking at you, double-doored, Sally. \"[People should] make their fridge smaller and shop twice a week and the first one makes the second one a necessity. The American refrigerators are so big they're built on American convenience culture. They want us to shop once a week and then when 'mealus interruptus' happens, and it happens to everyone, we wind up throwing out food on Sunday that we bought the Monday beforehand,\" said Zimmern. \"Meal planning is really important, but even more important is to shrink your fridge. I bought a small European refrigerator, and it was the best thing I ever did,\" he continued, adding that if you have a big American fridge simply remove a drawer and take out a shelf for two weeks and see how it goes. ", "2. Put a notepad and a pen on the counter next to the garbage can and write down all food that you put in the trash.", "\"Even if it's that bag that holds the bunches of grapes and there's a cup of loosies at the bottom and they're just bruised and rotted, write that down. At the end of the two weeks, you'll see the patterns,\" said Zimmern. \"I have a friend that wastes a lot of food, and fascinatingly I got him to write everything down. There was one item that every night was on his list, and it just said, 'half a salad bowl.' I asked him about it and was like, 'what do you mean like your own bowl of salad?' He was like, 'you know there's five people in our family, we like a big salad every night, we have this big salad bowl. We cut all this lettuce, tomato, cucumber, and carrots, and then we throw it in there, and we dress it with oil and vinegar and lemon juice, everyone's favorite dressing, a little bit of salt, herbs, and mustard and made this great vinaigrette. We only eat half of it, and then it's wilted by the time we clear the table, and we throw it away,'\" Zimmern recounted. \"I said 'don't throw it away, put it in a bag or a container, and the next morning instead of having pancakes one or two people can have a healthy blended salad as all or part of their breakfast. You won't throw it away and save a meal or two every day depending on the size.'\" Little changes can go a long way, y'all.", "Chronic fruit-tosser? Put old fruit in your freezer before it becomes unusable and repurpose it. \"Before it gets bruised and rotten, and you throw it away, do what we do for bananas with banana bread, throw it in the freezer. Then roast it, turn it into sauces, purée it, turn it into freezer jams, but if you don't write it down you won't know what your trends are,\" shared Zimmern.", "3. Stop stocking up on excessive amounts of pantry ingredients.", "Really. Just hear him out. \"People wind up buying so many things they don't need or are only going to need once, and then they forget to use it up. A great example is someone will decide that they want to make some wonderful Thai dish, and they'll buy some sweet Thai sticky rice, and they soak it overnight, and they steam it for a couple of hours, and it's wonderful and then that rice just sits on the shelf for two years,\" commented Zimmern. \"Then they go into it again and, you know, there's little bugs or something crawled in there, or it drops and spills or someone says, 'oh it's been there for two years, let's get rid of it.' I encourage people, buy less. When I buy a five-pound bag of Thai sticky rice, do I eat it every night? No, but I make a concerted effort every week to cook a dish and use the Tai sticky rice in it. That's good menu planning,\" he said, noting that we should all observe the FIFO principle, — or \"first-in, first out\"— making sure that we use up items that we opened or bought first before moving on to another item (say, that half-opened jar of medium salsa should be used up before you open up a jar of spicy salsa). ", "We're certainly looking forward to incorporating these tips into our daily routines. And making some banana bread, of course."], "output_text": [" Follow @AldiUSA on Twitter for daily tips and schedules. Download the Stop Wasting Food app for free from the App Store for ICYMI tips and practical advice.", " Not the energy savings — these only arise if you have a suitable motor size, which isn’t the case for the most power-efficient models — but the electrical performance. If you’re subscribed to the fridge or freezer, which you should be… then this helps you lower that too.", " Double door is for cooling and noise proofing so the refrigerators are not passive warmers.", " Do you want less in your belly and more in your checking account? Three easy ways to do it.", " If you're not devoting time to planning the meals you're going to make, shop properly, and prep ingredients, you could end up with a bad habit that's going to cost you money. Think of how many commercial break-hour junk-food snack runs you'll end up skipping if you start being decent to yourself in this way. #LoveYourself", " Remember, you have a freezer, even if you have only a hot box. Cookies get better, bread gets crustier when they're nearly frozen, fruit becomes chewy when pineapple goes on sale, and being familiar with the cycle of your favorite grocery store's prices can save you money and waste. If that isn't just a case for persevering rather than succumbing to depression, I don't know what is.", " If you’re buying food to just have “enough” of something you rarely consume (ie: seasoning, canned tomatoes, honey, etc.), stop. Get yer frugal on and do a week’s worth of actual consumption. Y’all didn’t come here just for the blog candy, now did ya?", " Don't buy more than you can use, make sure to use up what you've got first before opening a new jar.", " cook with coconut oil, and make some banana bread (I recommend Still Life in Four Parts.)"], "title": ""}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/culture/lucille-ball-siriusxm-podcast", "fields": {"source_text": ["During the sixties, while Lucille Ball was busy with her hit sitcom, \"The Lucy Show,\" she also produced a daily radio program called \"Let's Talk to Lucy.\" The program's tapes, which haven't been heard for decades, are now widely available via a SiriusXM channel and a new podcast.", "According to SiriusXM, \"In between starring in four television series and more than 70 films, Lucy would jump from set to set—tape recorder in hand—to talk about all aspects of life with some of the biggest names in Hollywood history.\" The stars Ball chatted with were also her friends. There are 240 episodes in all, and in them Ball talks to stars of stage and screen including Carol Burnett, Frank Sinatra, Dean Martin, Mary Tyler Moore, Bing Crosby, Bob Hope, and Barbra Streisand.", "The radio show tapes, which have been living in the Ball family archives for decades, are now being repurposed as a podcast. Episodes have already begun to air on SiriusXM's pop-up channel, Channel 104, and they will soon be available to stream on other platforms, including Pandora, Stitcher, and the Sirius XM app.  ", "Lucie Arnaz, Lucille Ball and Desi Arnaz's daughter, said in a press release, \"Although I have been caretaking these ancient tapes for over 30 years, I had never really listened to them all and had no idea how many remarkable people Mom had talked to on these radio shows. It's a treasure trove of personal information from some of the greatest talents of American entertainment and my family and I can't wait to share them with the rest of the planet.\"", "In addition to the archival interviews, the podcast will also feature new programming that invites stars of today, including Ron Howard, Tiffany Haddish, Debra Messing, and Amy Poehler, to talk about Ball and her legacy.", "You can tune in and find more information about the podcast at siriusxm.com.", "What's your go-to podcast for daily listening? Have you heard any of the \"Let's Talk to Lucy\" programs?"], "output_text": [" Head to this channel, subscribe, and enjoy not listening to Lucy while she talks your ear off about production decisions and contract negotiations.", " Jamie is the best. Here are 11 quirky facts about Jamie that prove he's the best.", " I made this sign and the guy carrying it is me. ", " The nerds win.", " Starting April 27, we're launching a full-throttle, 5-episode season of three mini-documentaries about the Barbra Streisand revolutionary, coming to you live from “her,” BRAVO’s new stream of the visually compelling, explicitly real, remarkably relatable, painfully vulnerable — and irrepressibly fearless — Babs. Because she’s a lesson for the young girls yelling at the top", " 12-03-93", " Donato Dozzy on \"Let's Talk to Lucy,\" the interplay between gentleness and glitch-like digital sharpness, and the delicacy vs. the brutality. (sorry, terrible writers) $support us on patreon: http://ift.tt/2ceHYTk"], "title": ""}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/garden/indoors/best-houseplants-for-low-light", "fields": {"source_text": ["If you love plants but live in a space that's lacking in light, don't despair. There are plants that you can grow even in the darkest of corners and dimmest of rooms. From long-loved houseplants like philodendrons and parlor palms to new favorites with beautiful leaves, like calatheas and arrowhead plants, there's a species on this list that's perfect for your window-challenged abode. Once you've chosen a new plant or two, remember that the most important part of tending houseplants is to pay attention. Checking on them regularly and identifying their light and water needs will help you help them. Even the hardiest of houseplants need some time to adapt to new spaces. All of these plants can tolerate low light, though some do grow best in medium indirect light. Do a little research and find the ones that will work for you.", "Syngonium podophyllumArrowhead plants have spade-shaped flowers in a variety of colors, including green, cream, silver, and pink. They tolerate low light and appreciate high humidity.", "Calathea sp.These easy-to-grow plants can thrive in spaces with minimal sunlight. They're prized for their foliage, which has striking colors and patterns. The species Calathea orbifolia has luminous green leaves.", "Aspidistra elatiorThese plants come by their common name honestly. They are very hardy can withstand most all conditions indoors, including low light.", "Dracaena sp.These pretty houseplants have strap-shaped leaves, many of which are striped with shades of green, cream, and grey. They have low light requirements and, in the right environment, can grow to 5-6 feet tall.", "Fittonia albivenisNerve plants can thrive in dim light. They are known for their foliage, which is deep green with red, pink, or white veins.", "Sansevieria trifasciataThese low-maintenance plants tolerate both low light and drought, which makes them popular plants for busy people. Just be sure to check on them every now and then to ensure they're growing well.", "Chlorophytum comosumWhile they grow best in medium levels of indirect light, the hardy spider plant can survive in low-light situations. Plant them in hanging baskets for a stream of lively green-and-white foliage.", "Chamaedorea elegansWith a name that nods to their popularity as houseplants, parlor palms are compact, slow-growing plantings that can thrive in small spaces and dim light. Their calling card is a burst of bushy, deep green foliage.", "Peperomia sp.These ornamental plants are grown indoors for their pretty foliage, which comes in an array of shapes and patterns. Peperomia albovittata has watermelon-patterned leaves that emerge in shady environs.", "Philodendron sp.There are nearly 500 species of philodendrons, some of which are grown as houseplants. They are some of the easiest to grow and have a variety of foliage colors and types. They grow best in dappled light and appreciate some shade.", "Pilea peperomioidesThis plant is also called a coin plant because its bright green foliage is coin-shaped and born lightly on thin stems. It loves the shade and shies away from too much bright light.", "Epipremnum aureumPothos, also known as devil's ivy, is an easy houseplant to grow, not least because it can tolerate dim light and a bit of drought.", "Zamioculcas zamiifoliaThis catchily named plant is a go-to houseplant for hands-off gardeners. It stands up to drought and low light with no trouble.", "What are your favorite houseplants? Do you have sunny windows or are you longing for some light?"], "output_text": [" Everyone, even those of us who don’t have a green thumb, can grow plants indoors. Check out these low-light plants and you'll have beautiful greenery in no time.", " Macrame is cheap, flexible and totally rad alternative decoration than say, orchid plants. Throw them against your windows , hang them from your home ceiling , catch them via some wires and throw them above your sofa .Use your imagination!", " The snake plant will not die. Simple water once a week in most conditions.", " There are about 30,000 snake species and they're all pretty amazing.", " I recommend the Confetti Nerve Plant.", " The right hydroponics systems only work if there is proper maintenance.", " It's pretty much like a regular plant, but with leaves the texture of bird's nests. I love it! Probably because it makes me as happy as a leprechaun when he gets three pots of gold, but also because my apartment gets a great deal of sun illumination, as well as indirect sunlight—I get both equally, and it's nice! Just be careful of over or underwatering, and it'll thrive! Good enough!", " Young love can be overwhelming", " The roots are bad in their own special way, so don’t eat them.", " Don't hold shoots and leaves up to the light and expect to see straight through them.Don't hold them up to a window, because the light from a window is not as examples of lab report cinematography intense (enough) as the light from the sun, and the sun is a lot farther away from earth. Some objects are harder than others to see through.", " Glossy leaves not native to South Carolina that require dim light still give plenty of autumn color.", " The devil is in the detail. The Devil - who sold us out. Devil image by Hank Hyena. The Devil's Breath Day on. Botanical filenames and synonyms included wherever botanical identification is possible, along with errors, misspellings and incorrect names. Devils Gold is an excellent medium to grow beautiful plants. It has been creating terrariums and you will see a few examples on this page. You can also use it", " Clean plants regularly for best growth.", " 7 Houseplants that Solve the Problem of Sunny Windows."], "title": "۩ ۩ ۩"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/recipes/chicken-bacon-ranch-casserole", "fields": {"source_text": ["Preheat oven to 375°F. Cook penne according to package directions; drain, reserving 1 cup cooking water. Place pasta in a large bowl, and set aside.\n                    ", "Heat a large skillet over medium. Add bacon, and cook, stirring often, until crisp, about 5 minutes. Using a slotted spoon, transfer bacon to a plate lined with paper towels. Reserve drippings in skillet.\n                    ", "Add garlic to hot drippings in skillet over medium, and cook, stirring constantly, until fragrant, about 1 minute. Whisk in whipping cream and cream cheese; cook, whisking often, until cream cheese is melted and mixture is smooth, about 2 minutes. Remove from heat, and stir in Parmesan, ranch dressing mix, pepper, and reserved 1 cup cooking water. Pour over pasta. Fold in chicken and 1 cup of the mozzarella cheese. Pour mixture into a lightly greased (with cooking spray) 13- x 9-inch baking dish. Top with bacon and remaining 1 cup cheese. \n                    ", "Bake in preheated oven until golden and bubbly, about 20 minutes. Sprinkle with parsley, and serve hot.\n                    "], "output_text": [" Put That Bitch In A Sandwich", " Everybody Likes It But Me", " a huge burst of flavor that hides a lot of protein. ", " Instead of using raw potatoes and tortillas to make wraps, try cucumber."], "title": "................................................"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/travel/texas/cafe-momentum-chad-houser", "fields": {"source_text": ["Chad Houser says that when he began pitching the idea of a restaurant staffed by former juvenile offenders, he was at times laughed out of the room. \"People said things like, 'Those kids don't want to work; they just want a paycheck.' Or, 'Those kids have never been to a nice restaurant; they can't cook your food.' \" But Houser, a chef who had volunteered in the juvenile department for years, knew that wasn't true. ", "He and a group of those teens began hosting successful pop-up dinners all over Dallas, and 12 months in, Houser sold his partnership in his own restaurant to start work on Café Momentum, a nonprofit eatery and yearlong post-release program for teens who have spent time in the area's juvenile-detention facilities. \"It's one thing to tell those kids you believe in them, and it's something different to prove it,\" says Houser. The restaurant opened in 2015, and beyond just providing job experience, the program also has what Houser calls an \"ecosystem of support.\" At their community center, there's a case management team to assist with financial literacy and parenting classes, a closet stocked with essentials free for the taking, and a school to help students finish their coursework. \"We receive accolades because what we do is working from the standpoint of reducing recidivism and increasing high school graduation,\" says Houser, who is helping launch the program in Pittsburgh and Nashville this year. \"But what I'm most proud of is that the kids get to say, 'I did this. I showed up. I graduated.' Whatever the accomplishment, it's theirs; they get to own it. They deserve that recognition.\""], "output_text": [" A program similar to Café Momentum is set to going down in Miami with Toria Green. Green, 30, has been in and out of the juvenile system since age 12. By her most recent imprisonment, she'd already spent six years behind bars, including Thanksgiving Day 2015, which she parlayed into her enthusiasm for entrepreneurship and creating \"something you're passionate about, even if it's not successful,\" in part by educating fellow inmates on economic"], "title": " Friday May 26 3:22 PM EDT The burlap tablecloths lie down the two lengthwise sides of the prep table like fr"}}, {"model": "dead_south.article", "pk": "https://www.southernliving.com/weddings/wedding-guest-etiquette-dress-codes", "fields": {"source_text": ["Any well-mannered wedding guest takes special note of the wedding day's dress code and arrives outfitted appropriately — but with your own touch of personal style. The prerequisite to adhering to the dress code? Well, understanding the dress code. From black tie to casual, we're here with an easy-to-follow guide to the top 5 wedding guest dress codes that you'll most commonly see on the lace-adorned invitations. Because there's no time to stress when merriment and a celebration of love is to be had. Here's how to dress confidently for your next wedding. ", "White tie: There aren't many times in life when this dress code will be required of you, unless you're attending a royal wedding, perhaps? White tie attire is the most formal dress code and typically calls for floor-length gowns for the ladies and a black dress coat with tails and matching pants for men, as well as a white bow tie and gloves. White tie attire has been around for a long time, but is pretty uncommon for modern weddings.", "Black tie: This is the most familiar formal dress code. Gents should dress in full tuxedos (possibly substituting a white dinner jacket in the warmer months), and the ladies should wear either elegant floor-length gowns or their most formal cocktail dresses. Since many of us don't have closets full of evening gowns at our disposal, this is the perfect time to consider using Rent the Runway to find hundreds of gowns for rent. Pull out your best jewelry, and don't be afraid to pop a red lip! ", "Black tie optional: This type of wedding is also referred to as simply \"formal.\" As the name suggests, it allows a bit more flexibility than a black tie dress code. Men can wear tuxedos or formal dark suits, and women can wear anything from evening gowns to dressy cocktail attire. Want to straddle the line? Choose a long dress with a bit less structure and more color than a black tie wedding would require. Basically, you can get a little more fun with it. ", "Semi-formal: Also known as \"cocktail,\" this is one of the most popular dress codes, and for good reason. It fits in with almost any wedding venue and is relatively easy for guests to abide by. A semi-formal dress code calls for suits for the men and cocktail dresses for the ladies. Since many women have a favorite go-to cocktail dress — little black dress, anyone? — it's a fabulous idea to wear the same dress for multiple events, paired with completely different accessories. You can also employ sneaky beauty tweaks, such as changing up from hair down to an updo, or a smoky eye to a bright lip color! ", "Casual: Likely the invitation will say, \"dressy casual.\" (Don't get our style editor started on how confusing that term can be for guests.) Going to a beach, farm, or very intimate wedding? There's a good chance the dress code will be casual, but that doesn't mean jeans and tank tops are acceptable — unless otherwise specified, of course. We suggest at least a dress shirt and dress pants or khakis for the gentlemen, and a pretty sundress and wedges or sandals for the ladies.", "Our last handy rules of thumb for all of the above dress codes? First, avoid wearing anything that is more than 50 percent white. Don't want to upstage the bride! Second, keep attire guidelines for ceremonies at houses of worship in mind. Third, some invitations might recommend dressing \"festive\" or (in cases of tropical weddings and the like) \"on theme,\" which might mean to break out the bright colors and bold accessories in addition to adhering to cocktail attire. ", "Finally, when in doubt, always err on the side of overdressed. Who doesn't love an extra fancy night out, anyway? "], "output_text": [" \"Its etiquette to always get dressed in your fine wear, well in advance of need, in anticipation of running into people who don't know your schedule or might be worried you forgot.\"", " Don't stress too much.", "Dress to impress, remember that this is a *job interview in all but name, and please don't ask the interviewers in fancy clothes to take you to Applebee's for a beer. Oh, and be sure to add fruit and cheese instead of a movie!", " Black tie is an evening wedding dress code that calls for a little more refined look. The dress code expertly treads the line between classy and formal, making it the litmus test of formality for a formal wedding. You can take it as formal or as fun as you want, from a long, regimented gown that goes from floor to ceiling (sometimes even up past the waist) or a fun, structured party dress that shows a little", " a nod to the recent wave of '90s nostalgia, these lines became a popular way to customize and update your mani at the same time. Liners have been making a huge show on the runways over the past three years and you can expect to see them everywhere. Here are some pointers on how to nail the trend (or not).", " Don't sweat it too much if you really have no idea about the dress code, just wear somewhere between \"formal\" and the most dressed up you've ever been yourself. Some context might help, but ultimately the only way to know what's appropriate is to put on what you know you feel good in, from clothes to shoes to confidence. Then go enjoy yourself at a great celebration.", " It's important to note that, while certain cultural dress codes (Things That Fit in Your Pants) such as suits, whites, and black tie are always going to be popular, it’s the spirit in which you wear those items that matter. For an event you're not familiar with, news or connections usually fill in what to wear, but when in doubt, TRY BEFORE YOU BUY. It's not personal like a hug.", " Whatever They Wanna Wear Will Be Fine For The Party. Wear Whatever You Want <3"], "title": "什麼訂婚喜歡裙裝[大紅蜜"}}]